# linuxではディレクトリやファイルを階層構造で管理します。
# 「ルートディレクトリ」「ホームディレクトリ」とは何ですか。それぞれ一言で説明してください。
--------------------
# ルートディレクトリ：階層型ファイル構造における最上階層のディレクトリ（あるいはフォルダ）のこと。
# あらゆるファイルを格納している大元となるハードディスクやフロッピーディスクがこれに該当する。

# ホームディレクトリ：ログイン直後にいる場所。コンピュータのストレージ（外部記憶装置）内に用意された、個々の利用者が自由に使えるディレクトリ。

「ルートディレクトリ」　階層構造の最上位にあるディレクトリ。
「ホームディレクトリ」　各ユーザーに割り当てられたディレクトリ

--------------------
# 「ルートディレクトリ」「ホームディレクトリ」それぞれに移動するため、ターミナルで打つべきコマンドを答えてください。

> cd /
> cd ~ or cd

--------------------
# ターミナルでは、フォルダやファイル名の補完機能が使えます。これは具体的にどのような機能なのか説明してください。

# ターミナルでファイル名等の入力をするときに、途中まで入力してからTabキーを押すと、残りに文字が自動で入力される。該当するファイル等が複数ある場合は、Tabを２回押すと候補のリストが表示される。

--------------------
# 現在のカレントディレクトリが~/Desktopだったとします。デスクトップに「text」というフォルダがある場合、そのフォルダ名を相対パスおよび絶対パスで表してください。

~/Desktop/text
text
