# これからのカリキュラムで、主に学ぶのはRuby,Ruby on Railsを使ったアプリケーション開発のスキルです。
# 他のプログラミング言語やフレームワークと比較して、RubyやRailsにはどのような特徴があるか、箇条書きで述べてください。

# プログラミング言語Rubyには、非常にシンプルでソースコードを書きやすいという特徴があります。
# Ruby on Railsでは、Model、View、Controllerに分けて開発を行うことで、効率が良く、生産性の高い開発を実現できます。
# 開発速度が速いので、社内の柔軟な機能追加にも対応できるのが特徴。

＜Rubyの特徴＞
・スクリプト言語である。

プログラミング言語には、「コンパイラ言語」「スクリプト言語」と言われる部類の言語があります。
人間が書いたコードを、機械が実行するには「翻訳」を行う必要がありますが、コンパイラ言語は事前に全て翻訳します。スクリプト言語では随時翻訳しつつ実行されます。
この違いにより、スクリプト言語であるRubyはコンパイルが必要ないため開発しやすい反面、実行速度は遅めであるという特徴があります。

・オブジェクト指向言語である

Rubyはスクリプト言語ですが、最初からオブジェクト指向の言語として開発されました。そのため変更に強かったり、再利用しやすいコードを書きやすくなっています。

・生産性が高い
上記の理由から、Rubyはコードの記述量が少なくすんだりコンパイルの時間がかからないなど生産性が高いという特徴があります。そのため、フレームワークであるRailsと合わせて、短期間でプロダクト開発を進める必要があるスタートアップ企業で好まれて使用されています。

＜Railsの特徴＞
・言語としてRubyを使用しているため、比較的習得しやすい。

・習得したスキルを広く活用できる
言語によっては、使われているフレームワークが多数あります。例えばPHPを学んでも、それとは別に様々なフレームワークについても学ぶ必要があります。RubyについてはRailsがほぼ１択であるため、一度習得してしまえば幅広く活用することができます。

・開発を効率化する仕組みが多数用意されているため生産性が高い
Railsにはrails newをするだけでアプリの雛形を作成できたりActiveRecordによってSQL操作ができるなど、開発効率を高めてくれる仕組みが標準で組み込まれています。
